# Step 1.11

In [18]:
import pandas as pd

## Example I have chosen

In my case, as an example, I have created a CSV file called data_analytics_marks.csv to store the marks in Data Analytics of 5 students as follows

 * Peter,Rees,Male,80
 * Bhusan,Chettri,Male,70
 * Stacy,Barker,Female,87
 * Hilary,Rai,Female,78
 * Thomas,Hain,Male,80 
 

### How did I create this?
- Open any text editor tool (for example notepad)
- enter those details manually separated by a comma
- as per step 1.11 you are free to create any example as you like (manually) and then read that csv file in Jupyter notebook and check its contents!



Please note that I have placed the file 'data_analytics_marks.csv' in the same working directory where my Jupyter notebook is running from. In my case this Jupyter notebook file name is week1.ipynb

In [19]:
# by default pandas assumes the first row as header information. 
# If we do not provide the header=None parameter, then the first row is taken as header.

mydataset = pd.read_csv('data_analytics_marks.csv')

In [20]:
# Lets check the contents. Just type the name of the dataFrame 

mydataset

    Peter     Rees    Male  80
0  Bhusan  Chettri    Male  70
1   Stacy   Barker  Female  87
2  Hilary      Rai  Female  78
3  Thomas     Hain    Male  80

In [21]:
# lets check the basic statistics of the dataframe
mydataset.describe()

              80
count   4.000000
mean   78.750000
std     6.994045
min    70.000000
25%    76.000000
50%    79.000000
75%    81.750000
max    87.000000

In [22]:
# Example2: lets force pandas not to use the first column of our csv file for header information
# for that we can supply a parameter: header=None as shown below

mydataset = pd.read_csv('data_analytics_marks.csv',header=None)

In [23]:
mydataset

        0        1       2   3
0   Peter     Rees    Male  80
1  Bhusan  Chettri    Male  70
2   Stacy   Barker  Female  87
3  Hilary      Rai  Female  78
4  Thomas     Hain    Male  80

### Why do I see  a column of integers (0-4) and a row (0-3) in my dataframe?

 * this is the default behaviour (which we can change - we will see more later in week2). By default pandas assigns a column of integers ranging from 0 to N-1 (where N = total rows or records).
 * same is the case with header information. The first row is taken as header by default.

In [24]:
# lets check the basic statistics of the dataframe
mydataset.describe()

               3
count   5.000000
mean   79.000000
std     6.082763
min    70.000000
25%    78.000000
50%    80.000000
75%    80.000000
max    87.000000